RT-Thread/rt-thread/bsp/cy8c6347bzi-cy-pm/CY8C6347BZI/Test.cydsn/Generated_Source/PSoC6/cyfitter_sysint.h
/*******************************************************************************
* File Name: cyfitter_sysint.h
* 
* PSoC Creator  4.2
*
* Description:
* 
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#ifndef INCLUDED_CYFITTER_SYSINT_H
#define INCLUDED_CYFITTER_SYSINT_H
#include "cy_device_headers.h"

/* MCWDT_isr */
#define MCWDT_isr__INTC_CORTEXM4_ASSIGNED 1
#define MCWDT_isr__INTC_CORTEXM4_PRIORITY 0u
#define MCWDT_isr__INTC_NUMBER 19u
#define MCWDT_isr_INTC_CORTEXM4_ASSIGNED 1
#define MCWDT_isr_INTC_CORTEXM4_PRIORITY 0u
#define MCWDT_isr_INTC_NUMBER 19u

/* SysInt_SW */
#define SysInt_SW__INTC_CORTEXM4_ASSIGNED 1
#define SysInt_SW__INTC_CORTEXM4_PRIORITY 7u
#define SysInt_SW__INTC_NUMBER 0u
#define SysInt_SW_INTC_CORTEXM4_ASSIGNED 1
#define SysInt_SW_INTC_CORTEXM4_PRIORITY 7u
#define SysInt_SW_INTC_NUMBER 0u

/* UART0_SCB_IRQ */
#define UART0_SCB_IRQ__INTC_CORTEXM4_ASSIGNED 1
#define UART0_SCB_IRQ__INTC_CORTEXM4_PRIORITY 7u
#define UART0_SCB_IRQ__INTC_NUMBER 46u
#define UART0_SCB_IRQ_INTC_CORTEXM4_ASSIGNED 1
#define UART0_SCB_IRQ_INTC_CORTEXM4_PRIORITY 7u
#define UART0_SCB_IRQ_INTC_NUMBER 46u

#endif /* INCLUDED_CYFITTER_SYSINT_H */
